*** python me
#+begin_src python :results output
from re import findall

total1 = total2 = 0
enabled = True
data = open("./day3_input.txt").read()
# findall returns ($1, $2, $3, $4), where mult($1, $2) and $3 if do() exists and $4 if don't() exists
for a, b, do, dont in findall(r"mul\((\d+),(\d+)\)|(do\(\))|(don't\(\))", data):
    if do or dont:
        enabled = bool(do)
    else:
        x = int(a) * int(b)
        total1 += x
        total2 += x * enabled

print(total1,"\n", total2)
#+end_src

#+RESULTS:
: 178886550 
:  87163705
